

/*
×÷Õß:Ñî¹âÓî
Ê±¼ä:2025-10-21
×÷ÓÃ:
»ùÓÚÒÑ¾­Ğ´ºÃµÄI2CÓëJY61P´«¸ĞÆ÷Í¨ĞÅ
»ñÈ¡ÍÓÂİÒÇÊı¾İ
ĞèÒªµÄº¯Êı:
    I2C½Ó¿ÚÅúÁ¿¶ÁÈ¡º¯Êı
    I2C½Ó¿Ú·¢ËÍº¯Êı
JY61P¼Ä´æÆ÷ÊÇ16Î»

×÷Õß:Ñî¹âÓî
Ê±¼ä:2025-10-22
ÓÉÓÚI2CÍ¨ĞÅÎŞ·¨Çı¶¯JY61P
¸ÄÓÃUART3 PB10 PB11 Çı¶¯JY61P
*/

#include "jy61p.h"

void JY61P_I2C_read(uint16_t reg, uint16_t *dat)
{ // Ä¬ÈÏregÎª AX 52
    uint8_t pdata[24];
    pdata[0] = reg & 0xFF; // 1. ÓÃÈë¿Ú²ÎÊı
    /* Ğ´¼Ä´æÆ÷µØÖ· */
    I2C2_send_data(0xA0, pdata, 1);
    while (hi2cy.status != 1)
        ; // µÈ´ıÍê³É
    /* ¶Á 25 ×Ö½Ú£º1 ×Ö½Ú¼ÙĞ´µØÖ· + 24 ×Ö½ÚÊı¾İ */
    I2C2_read_data(0xA1, pdata, 3);
    while (hi2cy.status != 1)
        ; // µÈ´ıÍê³É
    /* Æ´ 12 ¸ö 16-bit Öµ£¨Ğ¡¶Ë£© */
    for (int i = 0; i < 12; i++)
        dat[i] = ((uint16_t)pdata[i * 2] << 8) | pdata[i * 2 + 1]; // 2. ¼ÓÀ¨ºÅ+ÕıÈ·Ë³Ğò
}

#include "math.h"
void get_JY61P(u8 *C, float *G, float *AW, float *A, float *T)
{
    char sum1, sum2, sum3;
    sum1 = C[0] + C[1] + C[2] + C[3] + C[4] + C[5] + C[6] + C[7] + C[8] + C[9];
    sum2 = C[11] + C[12] + C[13] + C[14] + C[15] + C[16] + C[17] + C[18] + C[19] + C[20];
    sum3 = C[22] + C[23] + C[24] + C[25] + C[26] + C[27] + C[28] + C[29] + C[30] + C[31];
    if (C[0] == 0X55 && C[1] == 0X51) // ¼ÓËÙ¶È
    {
        if (C[10] == sum1)
        {
            G[0] = (float)((short)(C[3] << 8) + C[2]) / 32767 * 16;
            G[1] = (float)((short)(C[5] << 8) + C[4]) / 32767 * 16;
            G[2] = (float)((short)(C[7] << 8) + C[6]) / 32767 * 16;
            *T = (float)(short)((C[9] << 8) + C[8]) / 100;
        }
    }
    if (C[11] == 0X55 && C[12] == 0X52) // ½ÇËÙ¶È
    {
        if (C[21] == sum2)
        {
            AW[0] = (float)((short)(C[14] << 8) + C[13]) / 32767 * 2000;
            AW[1] = (float)((short)(C[16] << 8) + C[15]) / 32767 * 2000;
            AW[2] = (float)((short)(C[18] << 8) + C[17]) / 32767 * 2000;
        }
    }
    if (C[22] == 0X55 && C[23] == 0X53) // ËÄÔªÊı
    {
        if (C[32] == sum3) // Ğ£Ñé
        {
            // ä»å­—èŠ‚æ•°ç»„Cä¸­è§£æå››å…ƒæ•°ï¼ˆ16ä½æœ‰ç¬¦å·æ•´æ•°â†’å½’ä¸€åŒ–åˆ°[-1,1]ï¼‰
           A[0]  = (float)((short)(C[25] << 8 | C[24])) / 32767.0f*180.0f; // wï¼ˆå®éƒ¨ï¼‰
           A[1]  = (float)((short)(C[27] << 8 | C[26])) / 32767.0f*180.0f; // xï¼ˆè™šéƒ¨Xï¼‰
           A[2]  = (float)((short)(C[29] << 8 | C[28])) / 32767.0f*180.0f; // yï¼ˆè™šéƒ¨Yï¼‰

        }
    }
}
